nordic-doki/fw-nrfconnect-nrf/samples/nrf_rpc/entropy_nrf53/cpuapp/src/main.c
/*
 * Copyright (c) 2020 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-BSD-5-Clause-Nordic
 */

#include <zephyr.h>

#include <nrf_rpc.h>

#include "entropy_ser.h"

#define BUFFER_LENGTH 10

static u8_t buffer[BUFFER_LENGTH];

static void async_callback(int result, u8_t* buffer, size_t length)
{
	size_t i;

	if (result) {
		printk("Entropy remote get failed: %d\n", result);
		return;
	}

	printk("async");

	for (i = 0; i < length; i++) {
		printk("  0x%02x", buffer[i]);
	}

	printk("\n");
}

void main(void)
{
	int err;

	printk("Entropy sample started[APP Core].\n");

	err = entropy_remote_init();
	if (err) {
		printk("Remote entropy driver initialization failed\n");
		return;
	}

	printk("Remote init send\n");

	while (true) {
#if 1
		k_sleep(K_MSEC(5000));
		
		err = entropy_remote_get(buffer, sizeof(buffer));
		if (err) {
			printk("Entropy remote get failed: %d\n", err);
			continue;
		}

		printk("sync ");

		for (int i = 0; i < BUFFER_LENGTH; i++) {
			printk("  0x%02x", buffer[i]);
		}

		printk("\n");
#endif
#if 1
		k_sleep(K_MSEC(5000));
		
		err = entropy_remote_get_inline(buffer, sizeof(buffer));
		if (err) {
			printk("Entropy remote get failed: %d\n", err);
			continue;
		}

		printk("inline ");

		for (int i = 0; i < BUFFER_LENGTH; i++) {
			printk("  0x%02x", buffer[i]);
		}

		printk("\n");
#endif
#if 1
		k_sleep(K_MSEC(5000));

		err = entropy_remote_get_async(sizeof(buffer), async_callback);
		if (err) {
			printk("Entropy remote get async failed: %d\n", err);
			continue;
		}
#endif
	}
}
